[
{
    "type": "preprint",
    "title": "Strategically Robust Game Theory via Optimal Transport",
    "authors": "N. Lanzetti*, S. Fricker*, S. Bolognani, F. Dörfler, D. Paccagnan",
    "venue": "arXiv preprint",
    "year": "2025",
    "url_title": "https://arxiv.org/abs/2406.10676",
    "url_paper": "https://arxiv.org/pdf/2406.10676",
    "abstract": "None"
  },
  {
    "type": "preprint",
    "title": "Variational Analysis in the Wasserstein Space",
    "authors": "N. Lanzetti*, A. Terpin*, F. Dörfler",
    "venue": "arXiv preprint",
    "year": "2024",
    "url:title": "https://arxiv.org/abs/2406.10676",
    "url_paper": "https://arxiv.org/pdf/2406.10676",
    "abstract": "None"
  },
 
  {
    "type": "journal",
    "title": "Distributional Uncertainty Propagation via Optimal Transport",
    "authors": "L. Aolaritei, N. Lanzetti, H. Chen, F. Dörfler",
    "venue": "IEEE Transactions on Automatic Control",
    "year": "2025",
    "url_title": "https://ieeexplore.ieee.org/document/10989586",
    "url_paper": "https://arxiv.org/pdf/2205.00343",
    "abstract": "This paper addresses the limitations of standard uncertainty models, e.g., robust (norm-bounded) and stochastic (one fixed distribution, e.g., Gaussian), and proposes to model uncertainty via Optimal Transport (OT) ambiguity sets. These constitute a very rich uncertainty model, which enjoys many desirable geometrical, statistical, and computational properties, and which: (1) naturally generalizes both robust and stochastic models, and (2) captures many additional real-world uncertainty phenomena (e.g., black swan events). Our contributions show that OT ambiguity sets are also analytically tractable: they propagate easily and intuitively through linear and nonlinear (possibly corrupted by noise) transformations, and the result of the propagation is again an OT ambiguity set or can be tightly upper bounded by an OT ambiguity set. In the context of dynamical systems, our results allow us to consider multiple sources of uncertainty (e.g., initial condition, additive noise, multiplicative noise) and to capture in closed-form, via an OT ambiguity set, the resulting uncertainty in the state at any future time. Our results are actionable, interpretable, and readily employable in a great variety of computationally tractable control and estimation formulations. To highlight this, we study three applications in trajectory planning, consensus algorithms, and least squares estimation. We conclude the paper with a list of exciting open problems enabled by our results."
  },
  {
    "type": "journal",
    "title": "First-order Conditions for Optimization in the Wasserstein Space",
    "authors": "N. Lanzetti, S. Bolognani, F. Dörfler",
    "venue": "SIAM Journal on Mathematics of Data Science",
    "year": "2025",
    "url_title": "https://epubs.siam.org/doi/10.1137/23M156687X",
    "url_paper": "https://arxiv.org/pdf/2209.12197",
    "abstract": "We study first-order optimality conditions for constrained optimization in the Wasserstein space, whereby one seeks to minimize a real-valued function over the space of probability measures endowed with the Wasserstein distance. Our analysis combines recent insights on the geometry and the differential structure of the Wasserstein space with more classical calculus of variations. We show that simple rationales such as “setting the derivative to zero” and “gradients are aligned at optimality” carry over to the Wasserstein space. We deploy our tools to study and solve optimization problems in the setting of distributionally robust optimization and statistical inference. The generality of our methodology allows us to naturally deal with functionals, such as mean-variance, Kullback–Leibler divergence, and Wasserstein distance, which are traditionally difficult to study in a unified framework."
  }
]
