[
  {
    "type": "cs_conference",
    "title": "Learning Diffusion at Lightspeed",
    "authors": "A. Terpin, N. Lanzetti, M. Gadea, and F. Dörfler.",
    "venue": "38th Conference on Neural Information Processing Systems (NeurIPS)",
    "year": "2024",
    "url_title": "https://arxiv.org/abs/2406.12616",
    "url_paper": "https://arxiv.org/pdf/2406.12616",
    "code": "https://github.com/antonioterpin/jkonet-star",
    "abstract": "Diffusion regulates numerous natural processes and the dynamics of many successful generative models. Existing models to learn the diffusion terms from observational data rely on complex bilevel optimization problems and model only the drift of the system. We propose a new simple model, JKOnet*, which bypasses the complexity of existing architectures while presenting significantly enhanced representational capabilities: JKOnet* recovers the potential, interaction, and internal energy components of the underlying diffusion process. JKOnet* minimizes a simple quadratic loss and outperforms other baselines in terms of sample efficiency, computational complexity, and accuracy. Additionally, JKOnet* provides a closed-form optimal solution for linearly parametrized functionals, and, when applied to predict the evolution of cellular processes from real-world data, it achieves state-of-the-art accuracy at a fraction of the computational cost of all existing methods. Our methodology is based on the interpretation of diffusion processes as energy-minimizing trajectories in the probability space via the so-called JKO scheme, which we study via its first-order optimality conditions.",
    "notes": "oral presentation (0.39%)"
  },
  {
    "type": "cs_conference",
    "title": "Fairness in Social Influence Maximization via Optimal Transport",
    "authors": "S. Chowdary, G. De Pasquale*, N. Lanzetti*, A. Stoica, and F. Dörfler.",
    "venue": "38th Conference on Neural Information Processing Systems (NeurIPS)",
    "year": "2024",
    "url_title": "https://arxiv.org/abs/2406.17736",
    "url_paper": "https://arxiv.org/pdf/2406.17736",
    "code": "https://github.com/nicolaslanzetti/fairness-sim-ot",
    "abstract": "We study fairness in social influence maximization, whereby one seeks to select seeds that spread a given information throughout a network, ensuring balanced outreach among different communities (e.g. demographic groups). In the literature, fairness is often quantified in terms of the expected outreach within individual communities. In this paper, we demonstrate that such fairness metrics can be misleading since they ignore the stochastic nature of information diffusion processes. When information diffusion occurs in a probabilistic manner, multiple outreach scenarios can occur. As such, outcomes such as \"in 50% of the cases, no one of group 1 receives the information and everyone in group 2 receives it and in other 50%, the opposite happens\", which always results in largely unfair outcomes, are classified as fair by a variety of fairness metrics in the literature. We tackle this problem by designing a new fairness metric, mutual fairness, that captures variability in outreach through optimal transport theory. We propose a new seed selection algorithm that optimizes both outreach and mutual fairness, and we show its efficacy on several real datasets. We find that our algorithm increases fairness with only a minor decrease (and at times, even an increase) in efficiency."
  },
  {
    "type": "cs_conference",
    "title": "Trust Region Policy Optimization with Optimal Transport Discrepancies: Duality and Algorithm for Continuous Actions",
    "authors": "A. Terpin*, N. Lanzetti*, B. Yardim, F. Dörfler, and G. Ramponi.",
    "venue": "36th Conference on Neural Information Processing Systems (NeurIPS)",
    "year": "2022",
    "url_title": "https://arxiv.org/abs/2210.11137",
    "url_paper": "https://arxiv.org/pdf/2210.11137",
    "video": "files/conferences/NeurIPS2022/lightboard.mp4",
    "code": "https://gitlab.ethz.ch/lnicolas/ot-trpo",
    "abstract": "Policy Optimization (PO) algorithms have been proven particularly suited to handle the high-dimensionality of real-world continuous control tasks. In this context, Trust Region Policy Optimization methods represent a popular approach to stabilize the policy updates. These usually rely on the Kullback-Leibler (KL) divergence to limit the change in the policy. The Wasserstein distance represents a natural alternative, in place of the KL divergence, to define trust regions or to regularize the objective function. However, state-of-the-art works either resort to its approximations or do not provide an algorithm for continuous state-action spaces, reducing the applicability of the method. In this paper, we explore optimal transport discrepancies (which include the Wasserstein distance) to define trust regions, and we propose a novel algorithm - Optimal Transport Trust Region Policy Optimization (OT-TRPO) - for continuous state-action spaces. We circumvent the infinite-dimensional optimization problem for PO by providing a one-dimensional dual reformulation for which strong duality holds. We then analytically derive the optimal policy update given the solution of the dual problem. This way, we bypass the computation of optimal transport costs and of optimal transport maps, which we implicitly characterize by solving the dual formulation. Finally, we provide an experimental evaluation of our approach across various control tasks. Our results show that optimal transport discrepancies can offer an advantage over state-of-the-art approaches."
  }
]
